In [41]:
# a ditctionary
people = {
    "first": ["Corey","Jane","Joe"],
    "last": ["Schafer","Doe","Doe"],
    "email": ["Corey@email.com","Jane@email.com","Joe@email.com"]
}

In [2]:
import pandas as pd

In [42]:
df = pd.DataFrame(people)

In [4]:
df

   first     last            email
0  Corey  Schafer  corey@email.com
1   Jane      Doe   jane@email.com
2    Joe      Doe    joe@email.com

## Change values in Column names

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [9]:
# change all columns at once
df.columns = ['first_name', 'last_name', 'email']

In [10]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [12]:
#change column titles to uppercase
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME            EMAIL
0      Corey   Schafer  corey@email.com
1       Jane       Doe   jane@email.com
2        Joe       Doe    joe@email.com

In [15]:
# replace spaces with underscores
df.columns = df.columns.str.replace(' ','_')
df

  FIRST_NAME LAST_NAME            EMAIL
0      Corey   Schafer  corey@email.com
1       Jane       Doe   jane@email.com
2        Joe       Doe    joe@email.com

In [16]:
#change back to lowercase
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name            email
0      Corey   Schafer  corey@email.com
1       Jane       Doe   jane@email.com
2        Joe       Doe    joe@email.com

In [20]:
#change specfic column names, add inplace to save to dataframe
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace = True)

In [18]:
df

  first_name last_name            email
0      Corey   Schafer  corey@email.com
1       Jane       Doe   jane@email.com
2        Joe       Doe    joe@email.com

## Change values in Rows values

In [23]:
# Change all values
df.loc[2] = ['Joe','Smith','JoeSmith@email.com']

In [24]:
df

   first     last               email
0  Corey  Schafer     corey@email.com
1   Jane      Doe      jane@email.com
2    Joe    Smith  JoeSmith@email.com

In [26]:
# change multiple values
df.loc[2, ['last','email']] = ['Doe','JoeDoe@email.com']

In [27]:
df

   first     last             email
0  Corey  Schafer   corey@email.com
1   Jane      Doe    jane@email.com
2    Joe      Doe  JoeDoe@email.com

In [30]:
# change a single value
df.loc[2, 'last'] = 'Smith'

In [31]:
df

   first     last             email
0  Corey  Schafer   corey@email.com
1   Jane      Doe    jane@email.com
2    Joe    Smith  JoeDoe@email.com

In [32]:
# another method, does not to seem it is better
df.at[2, 'last'] = 'Doe'

In [37]:
filt = (df['email'] == 'JoeDoe@email.com')
# gives a warning
df[filt]['last'] = 'Smith'

C:\Users\Julian\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [39]:
df.loc[filt, 'last'] = 'Smith'
df

   first     last             email
0  Corey  Schafer   corey@email.com
1   Jane      Doe    jane@email.com
2    Joe    Smith  JoeDoe@email.com

In [44]:
# change all email adresses to lower case
df['email'] = df['email'].str.lower()
df

   first     last            email
0  Corey  Schafer  corey@email.com
1   Jane      Doe   jane@email.com
2    Joe      Doe    joe@email.com

### apply-method

In [47]:
# apply a function to a column
df['email'].apply(len)

0    15
1    14
2    13
Name: email, dtype: int64

In [49]:
#example function
def update_email(email):
    return email.upper()

In [50]:
df['email'].apply(update_email)

0    COREY@EMAIL.COM
1     JANE@EMAIL.COM
2      JOE@EMAIL.COM
Name: email, dtype: object

In [52]:
df['email'] = df['email'].apply(update_email)

In [53]:
#using a lambda function
df['email'] = df['email'].apply(lambda x : x.lower())

In [54]:
df

   first     last            email
0  Corey  Schafer  corey@email.com
1   Jane      Doe   jane@email.com
2    Joe      Doe    joe@email.com

In [55]:
df['email'].apply(len)

0    15
1    14
2    13
Name: email, dtype: int64

In [56]:
#shows the number of rows in every column, not all the rows length
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [57]:
#shows the first in alphabetical order in each column
df.apply(pd.Series.min)

first              Corey
last                 Doe
email    corey@email.com
dtype: object

In [60]:
#using lambda methods
df.apply(lambda x: x.min())

first              Corey
last                 Doe
email    corey@email.com
dtype: object

### applymap-method

In [63]:
# apply the functin to all elements in the dataframe
df.applymap(len)

   first  last  email
0      5     7     15
1      4     3     14
2      3     3     13

In [64]:
df.applymap(str.lower)

   first     last            email
0  corey  schafer  corey@email.com
1   jane      doe   jane@email.com
2    joe      doe    joe@email.com

### map-method

In [65]:
#substitutes each value in series with a new value, sets the unset values to NaN
df['first'].map({'Corey': 'Chris','Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

### replace-method

In [68]:
#replace the values in a series with new values, keeping the ones that were not altered
df['first'] = df['first'].replace({'Corey': 'Chris','Jane': 'Mary'})
df

   first     last            email
0  Chris  Schafer  corey@email.com
1   Mary      Doe   jane@email.com
2    Joe      Doe    joe@email.com